[
  {
    "image": "https://www.logo.wine/a/logo/Spotify/Spotify-Icon-Logo.wine.svg",
    "title": "Spotify Music",
    "companyName": "Spotify Ltd.",
    "id": 1,
    "description": "Spotify Music revolutionizes your audio experience with access to over 100 million songs, podcasts, and audiobooks from artists worldwide. Enjoy personalized recommendations through our advanced AI algorithms that learn your musical tastes and create custom playlists like Discover Weekly and Daily Mix. Stream in crystal-clear quality up to 320 kbps, download your favorite content for offline listening, and discover new music through curated editorial playlists. With Spotify Connect, seamlessly switch between devices without interrupting your listening experience. Create collaborative playlists with friends, explore artist radio stations, and enjoy ad-free listening with Spotify Premium. Whether you're working out, commuting, or relaxing at home, Spotify delivers the perfect soundtrack for every moment of your life with uninterrupted music discovery and enjoyment.",
    "size": 68,
    "reviews": 85,
    "ratingAvg": 4.5,
    "downloads": 11.5,
    "ratings": [
      { "name": "1 star", "count": 180000 },
      { "name": "2 star", "count": 240000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 3100000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms Inc.",
    "id": 2,
    "description": "WhatsApp Messenger redefines global communication with its fast, simple, and secure messaging platform trusted by over 2 billion users worldwide. Experience end-to-end encryption by default for all your personal messages, voice calls, and video calls, ensuring complete privacy for your conversations. Share high-quality photos and videos up to 100MB, documents of various formats, and your current location with ease. Create group chats with up to 1024 participants for family gatherings, work collaborations, or community discussions. Enjoy crystal-clear voice and video calls with up to 32 people simultaneously, perfect for business meetings or virtual celebrations. With WhatsApp Web and Desktop, seamlessly sync your conversations across all your devices. The Status feature lets you share text, photos, videos, and GIFs that disappear after 24 hours, while advanced features like message replies, forwarding with multiple contacts, and dark mode enhance your messaging experience. All this while using minimal data and maintaining the highest security standards in the industry.",
    "size": 45,
    "reviews": 112,
    "ratingAvg": 4.3,
    "downloads": 5.5,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 2200000 },
      { "name": "5 star", "count": 4800000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/thumbnails/018/930/415/small/instagram-logo-instagram-icon-transparent-free-png.png",
    "title": "Instagram",
    "companyName": "Meta Platforms Inc.",
    "id": 3,
    "description": "Instagram transforms how you capture and share life's moments through a visually stunning social media platform that connects over 2 billion users globally. Share high-resolution photos and videos up to 60 seconds in your feed, or create engaging Stories that disappear after 24 hours with interactive stickers, polls, and questions. Discover endless content through the Explore page, personalized to your interests using sophisticated machine learning algorithms. Go live with Instagram Live to connect with followers in real-time, or create short-form video content with Reels to showcase your creativity and potentially go viral. The Direct messaging feature enables private conversations with individuals or groups, while shopping tags and the Instagram Shop feature allow seamless product discovery and purchasing directly within the app. For creators and businesses, access detailed insights about your audience engagement, schedule posts in advance, and run targeted advertising campaigns. With features like multiple account support, archive options for old posts, and advanced editing tools with filters and effects, Instagram provides a comprehensive platform for personal expression, brand building, and community engagement in the digital age.",
    "size": 52,
    "reviews": 98,
    "ratingAvg": 4.2,
    "downloads": 5.7,
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2500000 },
      { "name": "5 star", "count": 6500000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/023/986/704/non_2x/youtube-logo-youtube-logo-transparent-youtube-icon-transparent-free-free-png.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 4,
    "description": "YouTube serves as the world's largest video platform and second-largest search engine, offering an unparalleled library of content spanning entertainment, education, music, news, and personal vlogs. Access billions of videos ranging from user-generated content to professional productions, with advanced search and recommendation algorithms that help you discover content tailored to your interests. Enjoy features like 4K Ultra HD video quality, 360-degree videos, and VR content for immersive viewing experiences. Create your own channel to upload videos up to 12 hours in length, customize your channel layout, and engage with your audience through comments and community posts. YouTube Premium offers ad-free viewing, background play for music and podcasts, and access to YouTube Originals exclusive content. For creators, access comprehensive analytics through YouTube Studio, monetize your content through the YouTube Partner Program, and utilize advanced editing tools. The platform supports multiple languages, closed captions, and automatic translations, making content accessible to global audiences. With YouTube Kids providing a safe environment for children and YouTube Music offering dedicated music streaming, this platform continues to revolutionize how we consume, create, and share video content in the digital era.",
    "size": 120,
    "reviews": 105,
    "ratingAvg": 4.4,
    "downloads": 12.5,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1100000 },
      { "name": "4 star", "count": 2600000 },
      { "name": "5 star", "count": 4700000 }
    ]
  },
  {
    "image": "https://logos-world.net/wp-content/uploads/2020/06/Snapchat-Logo.jpg",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 5,
    "description": "Snapchat pioneered ephemeral messaging and continues to innovate with its unique approach to visual communication that emphasizes authenticity and real-time sharing. Capture moments using thousands of interactive Lenses and Filters that transform your selfies with augmented reality effects, 3D objects, and face-altering technology. Share photos and videos that disappear after viewing, or add them to your Story for all friends to see for 24 hours. The Snap Map feature lets you see where your friends are and discover exciting events happening around you, while Our Story compiles Snaps from various users at major events to create collective narratives. Chat with friends through text, voice notes, or video calls, and use Bitmoji integration to express yourself with personalized avatars. Discover content from leading publishers, creators, and the community through the Discover section, and explore original shows and exclusive content. With features like Memories to save your favorite Snaps privately, Snap Games for interactive entertainment with friends, and Scan for visual search capabilities, Snapchat provides a comprehensive platform for creative expression and genuine connection. The app's focus on privacy, with notifications when someone screenshots your content, ensures a secure environment for sharing life's most authentic moments.",
    "size": 75,
    "reviews": 67,
    "ratingAvg": 4.1,
    "downloads": 11.5,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 280000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 1460000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/82/Telegram_logo.svg",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 6,
    "description": "Telegram stands as the fastest and most secure messaging app in the world, combining blazing-fast delivery with robust privacy features and unlimited cloud storage. Experience the freedom of sending any file type up to 2GB in size without compression, making it perfect for sharing high-quality media, documents, and archives. Engage in group chats with up to 200,000 members through powerful Channels and Groups features, complete with advanced admin tools, polls, quizzes, and custom permissions. Telegram's secret chats offer end-to-end encryption with self-destruct timers and prevent forwarding, while regular chats benefit from client-server encryption with secure cloud storage accessible across all your devices simultaneously. Create custom themes with advanced customization options, use animated stickers and emoji, and leverage powerful bots for automation and enhanced functionality. The platform supports voice chats with unlimited participants, video messages, and live streaming capabilities. With features like scheduled messages, translation tools, and a comprehensive API for developers, Telegram provides both individual users and organizations with a versatile communication platform that prioritizes speed, security, and scalability without compromising on user experience or feature richness.",
    "size": 40,
    "reviews": 58,
    "ratingAvg": 4.6,
    "downloads": 9.6,
    "ratings": [
      { "name": "1 star", "count": 90000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 1180000 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSAdmwjcwhArSmGHp593CuyRGvSArdc0wtkDQ&s",
    "title": "Zoom Meetings",
    "companyName": "Zoom Video Communications",
    "id": 7,
    "description": "Zoom Meetings has revolutionized remote collaboration by providing an enterprise-grade video conferencing platform that's remarkably easy to use for teams of all sizes. Host up to 1000 participants in a single meeting with crystal-clear HD video and audio quality, supported by robust infrastructure that ensures reliable connectivity worldwide. Experience advanced features like virtual backgrounds with green screen support, touch-up appearance filters, and immersive scene options that enhance your professional presence. Breakout rooms allow you to split larger meetings into smaller groups for focused discussions, while polling and Q&A features facilitate interactive sessions. Record meetings locally or to the cloud with automatic transcription services, and enable live streaming to social media platforms for larger audiences. Zoom's security features include end-to-end encryption for all meetings, waiting rooms for participant vetting, and host controls for managing screen sharing and participant permissions. Integrate with popular calendar systems, utilize whiteboarding tools for collaborative brainstorming, and leverage Zoom Apps to embed third-party applications directly into your meetings. Whether for business presentations, educational classes, healthcare consultations, or social gatherings, Zoom provides a comprehensive solution that bridges distances and enables meaningful connections across the globe.",
    "size": 80,
    "reviews": 73,
    "ratingAvg": 4.0,
    "downloads": 5.5,
    "ratings": [
      { "name": "1 star", "count": 280000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 1420000 }
    ]
  },
  {
    "image": "https://images.icon-icons.com/4029/PNG/512/twitter_x_new_logo_square_x_icon_256075.png",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "id": 8,
    "description": "X (formerly Twitter) serves as the world's real-time public conversation platform where news breaks, trends emerge, and global discussions unfold moment by moment. Share your thoughts through posts up to 25,000 characters, accompanied by photos, videos, GIFs, and polls to engage your audience. Follow journalists, celebrities, thought leaders, and friends to create a personalized timeline that keeps you informed about what matters most to you. Participate in Spaces for live audio conversations where you can listen or speak, join communities around shared interests, and utilize Lists to organize accounts into curated groups. The platform's advanced algorithm surfaces relevant content through For You and Following timelines, while Topics help you discover conversations about your interests. For creators and businesses, access analytics to understand audience engagement, schedule posts for optimal timing, and run targeted advertising campaigns. Premium features include edit post capability, longer video uploads, reduced advertising, and priority ranking in conversations. With robust safety tools including blocking, muting, and reporting features, combined with customizable notification settings and dark mode options, X provides a dynamic environment for public discourse, networking, and staying connected to the pulse of global events and cultural moments as they happen in real-time.",
    "size": 58,
    "reviews": 89,
    "ratingAvg": 3.9,
    "downloads": 10.6,
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 900000 },
      { "name": "4 star", "count": 1300000 },
      { "name": "5 star", "count": 1300000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/020/336/373/non_2x/netflix-logo-netflix-icon-free-free-vector.jpg",
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "id": 9,
    "description": "Netflix transforms your entertainment experience with the world's leading streaming entertainment service, offering award-winning original series, films, documentaries, and stand-up specials across thousands of titles. Access a vast library that spans multiple genres including drama, comedy, thriller, romance, documentary, anime, and children's programming, with new content added weekly. Enjoy personalized recommendations powered by sophisticated algorithms that analyze your viewing habits to suggest shows and movies you'll love. Download your favorite titles for offline viewing during travel or commuting, and stream in up to 4K Ultra HD with HDR support for cinema-quality picture and Dolby Atmos for immersive audio. Create up to five individual profiles within a single account, each with its own personalized recommendations, viewing history, and maturity level settings. The Kids experience provides a safe, curated environment with parental controls and age-appropriate content. Netflix Originals include critically acclaimed series, blockbuster films, and exclusive documentaries that you won't find anywhere else. With features like skip intro, watch parties for synchronized viewing with friends, and multiple language options with subtitles and dubbing, Netflix delivers a premium entertainment experience that adapts to your schedule, preferences, and viewing habits while continuously expanding its diverse content library to keep you engaged and entertained.",
    "size": 110,
    "reviews": 94,
    "ratingAvg": 4.5,
    "downloads": 8.5,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 2450000 }
    ]
  },
  {
    "image": "https://1000logos.net/wp-content/uploads/2016/10/Amazon-logo-meaning.jpg",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "id": 10,
    "description": "Amazon Shopping brings the world's largest online marketplace to your mobile device, offering unparalleled convenience for discovering, comparing, and purchasing millions of products across every category imaginable. Browse through electronics, fashion, home goods, groceries, books, and more with intuitive search and filtering options that help you find exactly what you need. Enjoy exclusive app-only deals and lightning deals that offer significant savings on popular items, and use the barcode scanner to compare prices instantly while shopping in physical stores. Amazon's advanced recommendation engine suggests products based on your browsing history, purchase patterns, and items you've viewed. The augmented reality view lets you visualize how furniture and home decor would look in your space before buying. Manage your orders with real-time tracking, easy returns through the app, and secure payment options including Amazon Pay, credit cards, and EMI options. Subscribe to Amazon Prime for free fast shipping, access to Prime Video, Prime Music, and exclusive member deals. Features like daily rewards, wish lists, and the ability to create and share gift registries make Amazon Shopping your comprehensive retail companion that combines the convenience of online shopping with the assurance of Amazon's customer service, return policies, and secure transaction processing.",
    "size": 65,
    "reviews": 107,
    "ratingAvg": 4.4,
    "downloads": 6.3,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 350000 },
      { "name": "3 star", "count": 700000 },
      { "name": "4 star", "count": 1400000 },
      { "name": "5 star", "count": 3850000 }
    ]
  },
  {
    "image": "https://i.pinimg.com/736x/aa/70/8d/aa708d1f97a04f6f5a208213f89e1e67.jpg",
    "title": "Flipkart",
    "companyName": "Flipkart Pvt. Ltd.",
    "id": 11,
    "description": "Flipkart dominates India's e-commerce landscape by offering a comprehensive shopping experience tailored specifically for Indian consumers with localized products, payment methods, and delivery options. Explore millions of products across categories including mobiles, electronics, fashion, home appliances, groceries, and lifestyle products from both international brands and local sellers. Benefit from exclusive app-only deals, big billion day sales, and regular discount events that provide significant savings on premium products. The platform's sophisticated recommendation system suggests products based on your browsing behavior, purchase history, and trending items in your region. Use multiple payment options including cash on delivery, credit/debit cards, net banking, UPI payments, and Flipkart's own payment solutions for seamless transactions. Flipkart Plus membership offers free unlimited delivery, early access to sales, and special rewards for loyal customers. Features like product comparisons, detailed customer reviews and ratings, video reviews, and image search help you make informed purchasing decisions. The app integrates with Flipkart Wholesale for business purchases, Flipkart Health+ for pharmacy needs, and offers installation services for electronics and appliances. With robust customer protection policies, easy return processes, and real-time order tracking, Flipkart provides a trusted shopping ecosystem that understands and serves the unique needs of Indian consumers while continuously innovating to enhance the mobile commerce experience.",
    "size": 50,
    "reviews": 76,
    "ratingAvg": 4.3,
    "downloads": 5.7,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 350000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 2150000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/thumbnails/019/909/641/small/paytm-transparent-paytm-free-free-png.png",
    "title": "Paytm",
    "companyName": "Paytm Payments Bank",
    "id": 12,
    "description": "Paytm has revolutionized digital payments and financial services in India by creating a comprehensive ecosystem that handles everything from mobile recharges to banking, investments, and insurance. Make instant payments using UPI, wallet, cards, or net banking at millions of merchants across India, both online and offline. Recharge your mobile phone, pay electricity bills, water bills, gas cylinders, DTH services, and broadband bills with just a few taps, while earning cashback and rewards. Book flight tickets, train tickets, bus tickets, and movie tickets with exclusive offers and seamless integration with various service providers. The Paytm Payments Bank offers zero-balance savings accounts with interest earnings, fixed deposits, and effortless money transfers. Invest in stocks, mutual funds, and digital gold through the app's integrated investment platforms, and purchase insurance policies for life, health, and vehicles. The Paytm Mall feature provides shopping deals across categories, while the entertainment section offers game recharges and event bookings. With features like QR code payments for merchants, postpaid credit services, loan offerings, and comprehensive transaction history, Paytm serves as an all-in-one financial super app that simplifies money management for millions of Indians while promoting digital literacy and financial inclusion through user-friendly interfaces and robust security measures.",
    "size": 42,
    "reviews": 83,
    "ratingAvg": 4.1,
    "downloads": 5.9,
    "ratings": [
      { "name": "1 star", "count": 280000 },
      { "name": "2 star", "count": 320000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 2100000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/021/514/743/non_2x/google-gmail-logo-symbol-design-illustration-free-vector.jpg",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 13,
    "description": "Gmail redefines email management with its intelligent, secure, and productivity-focused approach to digital communication, trusted by over 1.8 billion users worldwide. Organize your inbox with automatic categorization of emails into Primary, Social, and Promotions tabs, while important messages are highlighted for your attention. Benefit from 15GB of free storage shared across Google Drive, Photos, and Gmail, with options to purchase additional space as needed. The smart compose feature suggests complete sentences as you type, while smart reply offers quick response options to common emails. Schedule emails to be sent later, snooze messages to reappear at more convenient times, and set up vacation responders for automatic replies. Advanced search capabilities allow you to find any email using keywords, sender information, attachment types, or date ranges. Gmail's robust security features include phishing protection, suspicious activity alerts, and two-factor authentication options. Integrate seamlessly with other Google Workspace apps like Calendar, Meet, and Drive, and access third-party add-ons for enhanced functionality. The confidential mode lets you set expiration dates on sensitive emails and revoke access anytime, while offline capability ensures you can read, respond to, and search your emails even without an internet connection. With support for multiple accounts, customizable swipe actions, and dark mode for comfortable viewing, Gmail provides a comprehensive email solution that adapts to your workflow while maintaining the highest standards of security and reliability.",
    "size": 90,
    "reviews": 118,
    "ratingAvg": 4.6,
    "downloads": 7.6,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 5600000 }
    ]
  },
  {
    "image": "https://mashdigi.com/wp-content/uploads/2020/02/googlemaps.5.jpg",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 14,
    "description": "Google Maps serves as your ultimate navigation companion, offering detailed maps, real-time traffic information, and comprehensive business listings for over 220 countries and territories worldwide. Get turn-by-turn navigation for driving, walking, cycling, and public transportation with voice guidance and lane assistance that helps you navigate complex intersections. Access real-time traffic conditions, incident reports, and estimated travel times that automatically adjust based on current road conditions. Explore indoor maps for airports, shopping malls, and stadiums, and use Street View to visually explore neighborhoods before you visit. Discover local businesses with detailed information including hours, photos, menus, and aggregated reviews from multiple sources. Save your favorite places, create custom maps with multiple stops, and share your real-time location with friends and family. The offline maps feature allows you to download specific areas for navigation without an internet connection, perfect for international travel or areas with poor connectivity. Google Maps integrates with your calendar to suggest departure times for appointments, provides eco-friendly routing options to reduce fuel consumption, and offers accessibility information for wheelchair-friendly routes. With features like augmented reality walking directions, timeline to review your location history, and contributions to improve map accuracy, Google Maps provides an indispensable tool for both daily commuting and global exploration while continuously evolving with new features that make navigation smarter and more intuitive.",
    "size": 130,
    "reviews": 102,
    "ratingAvg": 4.5,
    "downloads": 7.2,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 4000000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/006/057/996/non_2x/tiktok-logo-on-transparent-background-free-vector.jpg",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 15,
    "description": "TikTok has transformed digital entertainment by creating a vibrant platform where creativity flourishes through short-form video content that captivates global audiences. Create engaging videos from 15 seconds to 10 minutes using an extensive library of effects, filters, transitions, and editing tools that require no professional expertise. Access millions of soundtracks, voiceovers, and audio clips to enhance your content, with the ability to use original audio or participate in trending challenges. The For You page delivers a personalized feed of content curated by sophisticated algorithms that learn your preferences and introduce you to new creators and trends. Go live to connect with your audience in real-time, host Q&A sessions, and receive virtual gifts from your followers. For creators, access detailed analytics about your content performance, audience demographics, and growth metrics to optimize your strategy. The Creator Fund and LIVE gifts provide monetization opportunities, while the Creator Marketplace facilitates brand partnerships. Features like Duet and Stitch allow you to collaborate with other creators by adding your video alongside theirs or incorporating clips from their videos into your content. With robust privacy controls, comment filters, family pairing for teen safety, and digital wellbeing features, TikTok provides a creative outlet that balances self-expression with community guidelines and user protection while continuously introducing innovative features that push the boundaries of mobile video creation and consumption.",
    "size": 90,
    "reviews": 91,
    "ratingAvg": 4.2,
    "downloads": 6.4,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 2700000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/0/08/Pinterest-logo.png",
    "title": "Pinterest",
    "companyName": "Pinterest Inc.",
    "id": 16,
    "description": "Pinterest serves as the world's catalog of ideas, inspiring users to discover, save, and create everything from home decor and fashion to recipes and travel plans through visual discovery and curation. Save Pins to organized Boards by category, project, or theme, and access them across all your devices with seamless synchronization. Use visual search to identify objects in Pins and find similar items or related ideas, or utilize the camera search to capture real-world objects and discover inspired creations. The home feed delivers personalized recommendations based on your saved Pins, search history, and interests, while Trending searches and seasonal collections keep you updated with current ideas. Create secret boards for private planning, collaborate on group boards with friends or family, and use sections within boards for better organization. Shop the Look feature allows you to purchase products directly from Pins, while price alerts notify you when items go on sale. For businesses and creators, access analytics to understand audience engagement, create promoted Pins for increased visibility, and utilize rich Pins with real-time information. The Try On feature for beauty products and augmented reality for home decor lets you visualize products before purchasing. With features like idea Pins for multi-page storytelling, board recommendations to discover new interests, and daily inspiration emails, Pinterest transforms aspiration into action by connecting creative ideas with practical implementation across every aspect of life.",
    "size": 60,
    "reviews": 54,
    "ratingAvg": 4.5,
    "downloads": 9.4,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 1180000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/067/941/680/non_2x/uber-eats-logo-rounded-hd-free-png.png",
    "title": "Uber Eats",
    "companyName": "Uber Technologies Inc.",
    "id": 17,
    "description": "Uber Eats delivers restaurant-quality meals to your doorstep with unprecedented speed, reliability, and choice, leveraging Uber's extensive logistics network and mapping technology. Browse through thousands of local restaurants, from popular chains to hidden neighborhood gems, with detailed menus, photos, and customer reviews to guide your selection. Filter by cuisine type, dietary preferences, delivery time, price range, and special offers to find exactly what you're craving. The app provides real-time order tracking that shows when your food is being prepared, when a delivery partner is assigned, and their estimated arrival time with live GPS tracking. Schedule deliveries in advance for meetings, events, or busy days, and save your favorite orders for quick reordering. Uber Eats Pass membership offers $0 delivery fees on eligible orders, special discounts, and priority support for frequent users. Group ordering features allow multiple people to add items to a single cart, perfect for office lunches or family dinners. The app supports multiple payment methods including credit cards, PayPal, and Uber Cash, with options to split bills among friends. With features like contactless delivery, live customer support, and comprehensive allergy information, Uber Eats provides a seamless food delivery experience that combines the convenience of technology with the pleasure of enjoying restaurant meals in the comfort of your home or office, available in thousands of cities worldwide with continuous expansion of restaurant partners and delivery areas.",
    "size": 75,
    "reviews": 69,
    "ratingAvg": 4.3,
    "downloads": 10.3,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 1450000 }
    ]
  },
  {
    "image": "https://logos-world.net/wp-content/uploads/2021/03/Facebook-Messenger-logo.png",
    "title": "Messenger",
    "companyName": "Meta Platforms Inc.",
    "id": 18,
    "description": "Facebook Messenger has evolved from a simple messaging platform to a comprehensive communication hub that connects over a billion people through text, voice, video, and interactive experiences. Send high-quality photos and videos, voice messages, and files of various types with end-to-end encryption available for secret conversations. Make crystal-clear voice and video calls with up to 50 people simultaneously, with features like screen sharing, virtual backgrounds, and room effects that enhance your video experience. Express yourself with thousands of stickers, GIFs, and emojis, and create custom reactions with your own emoji combinations. The app's dark mode reduces eye strain, while the custom chat themes and color gradients allow personalization of your conversation spaces. Use Messenger Rooms to create video chat rooms that people can join without a Facebook account, perfect for virtual events and spontaneous gatherings. Integrated games, watch together features for videos, and Spotify sharing enable shared experiences beyond simple messaging. For businesses, utilize automated responses, appointment scheduling, and payment processing within conversations. The vanish mode automatically deletes messages after they're seen, while the message requests folder helps manage communications from people outside your friend list. With cross-device synchronization, archive options for old conversations, and robust privacy controls, Messenger provides a versatile communication platform that adapts to both personal and professional needs while maintaining the connectivity that has made it an essential tool for global communication.",
    "size": 55,
    "reviews": 96,
    "ratingAvg": 4.3,
    "downloads": 8.9,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 1700000 },
      { "name": "5 star", "count": 3800000 }
    ]
  },
  {
    "image": "https://cdn-dynmedia-1.microsoft.com/is/image/microsoftcorp/RWCZER-Legal-IP-Trademarks-CP-MS-logo-740x417-1?wid=406&hei=230&fit=crop&resSharp=1",
    "title": "Microsoft Teams",
    "companyName": "Microsoft Corporation",
    "id": 19,
    "description": "Microsoft Teams redefines workplace collaboration by integrating chat, meetings, file sharing, and business applications into a single, secure platform that empowers hybrid work environments. Host meetings with up to 10,000 participants with enterprise-grade video and audio quality, supported by advanced background effects, together mode, and live captions in multiple languages. The platform's intelligent recording feature automatically generates transcripts with speaker attribution, while the raise hand, reactions, and polls facilitate interactive sessions. Teams channels organize conversations by project or topic, with file storage integrated directly with SharePoint for seamless document collaboration. Co-author documents in real-time with Office 365 integration, track changes, and maintain version history without leaving the application. The activity feed keeps you updated on mentions, replies, and shared files, while status messages and presence indicators show colleague availability. Customize your workspace with hundreds of business applications from the Teams app store, including project management tools, CRM integrations, and custom bots. Advanced security features include data encryption, compliance certifications, information barriers, and data loss prevention policies. For frontline workers, access walkie-talkie functionality, task management, and shift scheduling tools. With features like webinar hosting with registration pages, town hall events for large audiences, and breakout rooms for smaller discussions, Microsoft Teams provides a comprehensive solution that bridges the gap between in-office and remote work while maintaining the security, compliance, and integration capabilities that enterprises require.",
    "size": 95,
    "reviews": 71,
    "ratingAvg": 4.2,
    "downloads": 1000000000,
    "ratings": [
      { "name": "1 star", "count": 220000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 1130000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/023/986/970/non_2x/linkedin-logo-linkedin-logo-transparent-linkedin-icon-transparent-free-free-png.png",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "id": 20,
    "description": "LinkedIn stands as the world's largest professional network, connecting over 900 million professionals across industries, geographies, and career stages to create economic opportunity for every member of the global workforce. Build and maintain your professional identity with a comprehensive profile that showcases your experience, skills, education, and accomplishments, with customizable URL and background photo options. Expand your network by connecting with colleagues, clients, and industry peers, and join groups relevant to your professional interests for focused discussions and networking. The feed delivers personalized content including industry news, thought leadership articles, and updates from your network, while LinkedIn Learning provides access to thousands of courses for skill development. Job seekers can search millions of job listings, set up alerts for new opportunities, and see how they match positions with the skills and experience highlighted in their profiles. For recruiters and businesses, access advanced search filters to find ideal candidates, post job openings, and utilize InMail for direct messaging. The platform's content creation tools allow you to publish articles, share updates, and create newsletters to establish thought leadership. Premium features include enhanced visibility, detailed analytics on who's viewed your profile, and access to salary insights and business data. With features like LinkedIn Events for professional gatherings, volunteer opportunities, and alumni network tools, LinkedIn provides a comprehensive ecosystem for career development, professional networking, and business growth that adapts to your professional journey from student to executive level.",
    "size": 70,
    "reviews": 79,
    "ratingAvg": 4.4,
    "downloads": 9.3,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 1550000 }
    ]
  },
  {
    "image": "https://img.freepik.com/premium-vector/vector-discord-social-media-logo_534308-21667.jpg?semt=ais_hybrid&w=740&q=80",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 21,
    "description": "Discord has transformed digital communication by creating a versatile platform where communities form around shared interests, from gaming and education to art and professional collaboration. Create or join servers dedicated to specific topics, with organized text channels for discussions and voice channels for real-time conversation. The platform's low-latency voice chat ensures crystal-clear communication during gaming sessions, study groups, or virtual meetings, with noise suppression and echo cancellation for optimal audio quality. Video calls support screen sharing, allowing you to stream gameplay, presentations, or any application window to your audience. Text channels support rich formatting, file sharing up to 100MB, and code snippets with syntax highlighting for developers. Server members can use custom emojis, reactions, and threaded conversations to enhance communication. The platform's robust moderation tools include user roles with granular permissions, automated moderation bots, and content filtering to maintain community guidelines. Discord Stage Channels enable moderated audio events like town halls, podcasts, or Q&A sessions with designated speakers and audience members. Nitro subscription offers enhanced features like higher quality screen sharing, larger file uploads, and custom tags. With features like server templates for quick community setup, activity status integration with games and applications, and comprehensive privacy controls, Discord provides a flexible communication platform that adapts to communities of all sizes while maintaining the reliability and performance required for real-time interaction and long-term community building.",
    "size": 75,
    "reviews": 87,
    "ratingAvg": 4.6,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 1300000 },
      { "name": "5 star", "count": 3900000 }
    ]
  },
  {
    "image": "https://1000logos.net/wp-content/uploads/2021/05/Skype-logo.png",
    "title": "Skype",
    "companyName": "Microsoft Corp.",
    "id": 22,
    "description": "Skype continues to be a pioneer in global communication, offering reliable voice and video calling alongside messaging features that connect people across devices and platforms worldwide. Make high-quality video calls with up to 100 people for personal or business use, with features like background blur, call recording, and live subtitles in multiple languages. The platform's screen sharing capability allows you to present documents, photos, or your entire desktop during calls, perfect for collaborative work or technical support. Skype's messaging features include rich text formatting, file sharing up to 300MB, and photo/video sharing with automatic compression optimization. Create group chats with customized names and photos, use reactions to quickly respond to messages, and @mention specific people to get their attention. The Skype Number feature provides you with a dedicated phone number that people can call from traditional phones, while Skype To Go allows discounted calls to mobiles and landlines worldwide. For businesses, Skype Manager provides administrative controls, reporting, and billing management for organizational accounts. The platform's translation features offer real-time subtitle translation during calls and chat message translation in over 60 languages. With features like call forwarding to your mobile, voicemail with transcription, and integration with Outlook contacts, Skype provides a comprehensive communication solution that bridges the gap between personal and professional use while maintaining the reliability and cross-platform compatibility that has made it a trusted communication tool for millions of users over two decades.",
    "size": 80,
    "reviews": 65,
    "ratingAvg": 4.2,
    "downloads": 10,
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 1750000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/018/930/719/non_2x/viber-logo-viber-icon-transparent-free-png.png",
    "title": "Viber",
    "companyName": "Rakuten Inc.",
    "id": 23,
    "description": "Viber provides a feature-rich communication platform that combines messaging, voice calls, and community features with a strong emphasis on privacy and security for users worldwide. Enjoy end-to-end encryption by default for all your one-on-one and group conversations, ensuring that your messages, calls, and shared media remain private between you and your recipients. Make high-quality voice and video calls to other Viber users anywhere in the world at no cost, with the ability to call non-Viber users through Viber Out at competitive international rates. The app's communities feature allows you to create or join groups with up to 1 billion members for large-scale discussions, with admin tools, permissions, and broadcast lists for important announcements. Express yourself with thousands of stickers, GIFs, and emojis, including exclusive sticker packs from popular brands and artists. Viber's self-destruct timer for secret chats automatically deletes messages after a set time, while hidden chats require a PIN to access for additional privacy. The platform supports public accounts for businesses, celebrities, and content creators to engage with their audience through broadcasts, chatbots, and rich media content. Features like message reactions, reply to specific messages, and mention notifications enhance group communication efficiency. With cross-device synchronization, backup to Google Drive, and support for multiple languages, Viber provides a comprehensive messaging solution that balances rich features with robust security measures, making it ideal for both personal communication and community building across global audiences.",
    "size": 68,
    "reviews": 59,
    "ratingAvg": 4.4,
    "downloads": 10.2,
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 350000 },
      { "name": "4 star", "count": 650000 },
      { "name": "5 star", "count": 1350000 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTgZFtXjGjP-bv83TPj9hI5IRd3WYz5zYO7EUlrfluELBxVhIIQXf0ETUVcX4-EYvfFzlA&usqp=CAU",
    "title": "Slack",
    "companyName": "Slack Technologies LLC",
    "id": 24,
    "description": "Slack transforms workplace communication by replacing email with channels, creating an organized hub where teams can collaborate more effectively and transparently. Organize conversations into dedicated channels for projects, topics, or teams, with the ability to create public channels for company-wide discussions or private channels for sensitive topics. The platform's powerful search functionality indexes all your messages and files, making it easy to find past conversations, decisions, and shared documents. Integrate with over 2,400 apps including Google Drive, Office 365, Salesforce, and Zoom, bringing your essential tools directly into your workflow. Use workflow builder to automate routine processes without coding, creating custom workflows that trigger actions across integrated apps. Slack's threading feature keeps side conversations organized without disrupting the main channel flow, while reactions provide quick feedback without cluttering the conversation. The platform supports voice and video calls with screen sharing, and huddles offer lightweight audio conversations for quick discussions. For enterprises, Enterprise Grid provides advanced security controls, compliance certifications, and centralized administration across multiple workspaces. Features like scheduled messages, reminder settings, and status updates help manage communication expectations, while the do not disturb mode supports work-life balance. With customizable notifications, dark mode themes, and mobile optimization, Slack provides a flexible collaboration platform that adapts to your team's workflow while reducing email overload and creating a searchable knowledge base of your organization's communications.",
    "size": 90,
    "reviews": 52,
    "ratingAvg": 4.3,
    "downloads": 7.4,
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 90000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 1010000 }
    ]
  },
  {
    "image": "https://www.logo.wine/a/logo/Microsoft_Teams/Microsoft_Teams-Logo.wine.svg",
    "title": "Microsoft Teams",
    "companyName": "Microsoft Corp.",
    "id": 25,
    "description": "Microsoft Teams serves as the central hub for teamwork in Microsoft 365, bringing together chat, meetings, files, and apps in a single, integrated workspace that enables hybrid work scenarios. Host meetings with advanced features like together mode, which places participants in a shared background for more natural interactions, and large gallery view that displays up to 49 participants simultaneously. The platform's live reactions, raise hand features, and moderated Q&A sessions make large meetings more interactive and inclusive. Teams channels provide dedicated spaces for project collaboration, with tabs that integrate files, apps, and websites directly into the channel interface. Co-author documents in real-time with automatic version history and change tracking, with files stored in SharePoint for enterprise-grade security and compliance. The activity feed aggregates notifications from across your teams, while the command box allows quick access to people, files, and commands. Customize your workspace with apps from the Teams app store, build custom apps with Power Platform, and create automated workflows with Power Automate. Advanced security features include data loss prevention, information barriers, and advanced threat protection that safeguard your organization's sensitive information. For frontline workers, access shift scheduling, task management, and walkie-talkie functionality designed for mobile use. With features like webinar registration pages, town hall events for organization-wide communications, and breakout rooms for small group discussions, Microsoft Teams provides a comprehensive solution that connects distributed teams while maintaining the security, compliance, and integration capabilities required by modern enterprises operating in hybrid work environments.",
    "size": 110,
    "reviews": 95,
    "ratingAvg": 4.5,
    "downloads": 5.5,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 350000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 1600000 },
      { "name": "5 star", "count": 4250000 }
    ]
  },
  {
    "image": "https://www.logo.wine/a/logo/WeChat/WeChat-App-Icon-Logo.wine.svg",
    "title": "WeChat",
    "companyName": "Tencent Holdings Ltd.",
    "id": 26,
    "description": "WeChat has evolved from a simple messaging app into a comprehensive lifestyle platform that integrates social networking, mobile payments, and mini-programs to create an all-in-one digital ecosystem primarily serving Chinese users but with global reach. The app's messaging capabilities include text, voice messages, video calls, and group chats with up to 500 members, supported by stickers, emojis, and custom expressions. Moments function as a social feed where users share photos, videos, and status updates with their contacts, with privacy controls that determine visibility. WeChat Pay revolutionizes daily transactions by enabling mobile payments at millions of merchants, peer-to-peer transfers, bill payments, and financial services like wealth management products and insurance. Mini-programs provide lightweight app-like experiences within WeChat without installation, covering services from food delivery and ride-hailing to e-commerce and government services. Official accounts allow businesses, media, and celebrities to publish content, provide customer service, and engage with followers through automated responses and broadcasting. The platform's search functionality spans conversations, articles, mini-programs, and external content, while the shake feature connects users randomly for social discovery. WeChat Out offers low-cost international calls to landlines and mobiles worldwide, and the translation feature supports multiple languages for cross-cultural communication. With features like health codes for pandemic management in China, city services for government interactions, and file transfer capabilities between devices, WeChat demonstrates how a super app can integrate deeply into users' daily lives while maintaining a consistent user experience across its multifaceted functionality.",
    "size": 95,
    "reviews": 110,
    "ratingAvg": 4.1,
    "downloads": 18.5,
    "ratings": [
      { "name": "1 star", "count": 900000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 1100000 },
      { "name": "4 star", "count": 2100000 },
      { "name": "5 star", "count": 3900000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/018/910/751/non_2x/line-app-logo-line-app-symbol-line-icon-free-free-vector.jpg",
    "title": "LINE",
    "companyName": "LINE Corporation",
    "id": 27,
    "description": "LINE has become an essential communication and lifestyle platform across Asia, particularly in Japan, Taiwan, and Thailand, by combining messaging, social networking, and diverse services into a single application. The platform's messaging features include text, photos, videos, voice messages, and free voice/video calls, enhanced by an extensive collection of stickers featuring original characters like Cony, Brown, and Sally. Timeline serves as a social feed where users share updates with friends, while LINE Official Accounts allow businesses, celebrities, and media to broadcast messages and interact with followers. LINE Pay enables mobile payments at physical stores, online merchants, and peer-to-peer transfers, integrated with LINE Points rewards program. The platform's LINE Games offer casual gaming experiences with social features, while LINE Manga and LINE Music provide digital content subscriptions. LINE Shopping aggregates e-commerce deals and offers cashback rewards, and LINE Taxi integrates ride-hailing services in supported regions. Keep feature allows users to save important messages, links, and files with organized folders, while Note function enables blog-style posting with rich formatting. The platform supports multiple account types including business accounts with advanced features, and LINE WORKS extends the platform for enterprise communication with enhanced security and administrative controls. With features like hidden chats requiring authentication, message recall within 24 hours, and comprehensive privacy settings, LINE provides a versatile platform that balances social connectivity with practical services while maintaining the cute, friendly aesthetic that has become its trademark across Asian markets.",
    "size": 70,
    "reviews": 63,
    "ratingAvg": 4.4,
    "downloads": 5.8,
    "ratings": [
      { "name": "1 star", "count": 350000 },
      { "name": "2 star", "count": 280000 },
      { "name": "3 star", "count": 450000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 2120000 }
    ]
  },
  {
    "image": "https://www.logo.wine/a/logo/Google_Meet/Google_Meet-Logo.wine.svg",
    "title": "Google Meet",
    "companyName": "Google LLC",
    "id": 28,
    "description": "Google Meet provides enterprise-grade video conferencing that's secure, reliable, and easy to use, built on Google's robust infrastructure and integrated with the Google Workspace ecosystem. Host high-quality video meetings with up to 100 participants for up to 60 minutes in the free version, or unlimited duration with larger participant limits in Google Workspace plans. The platform's adaptive layout automatically adjusts to highlight active speakers, while tiled layout displays up to 16 participants simultaneously for more balanced visibility. Low-light mode enhances video quality in dim environments, and noise cancellation filters out background sounds for clearer audio. Live captions generated by Google's speech recognition technology make meetings more accessible and help non-native speakers follow conversations. The platform's security features include encryption in transit, anti-abuse protections, and meeting codes that are sufficiently long and complex to prevent guessing. Integration with Google Calendar allows one-click joining from calendar invites, while the mobile app provides full meeting functionality with optimized bandwidth usage. Hosts can control participant access through admission requests, manage who can present content, and remove participants if necessary. For education users, breakout rooms enable small group discussions, attendance tracking provides participation records, and hand raising features manage speaking order. With features like polls and Q&A for interactive sessions, recording to Google Drive for later reference, and international dial-in numbers for participants without internet access, Google Meet provides a comprehensive video conferencing solution that scales from quick one-on-one calls to large organizational meetings while maintaining the simplicity and reliability that users expect from Google products.",
    "size": 85,
    "reviews": 81,
    "ratingAvg": 4.5,
    "downloads": 10.3,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 250000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 3750000 }
    ]
  }
]